# ******************* Limpieza de Datos *******************

In [ ]:
import pandas as pd

dataset = pd.read_csv("titanic.csv", sep=",")

# mira los primeros 10 registros del dataset

In [61]:
dataset.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

# mira los ultimos 10 registros del dataset

In [62]:
dataset.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# describe el dataset estadisticas basicas

In [63]:
dataset.describe()  #sirve para ver estadisticas de las columnas numericas

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

# informacion del dataset

In [64]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [65]:
# "Age" es un objeto de tipo float64
dataset.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

# aquellos valores que son nulos(NaN) se 
# reemplazan por la media de la columna

In [8]:
# "fillna" es el método para rellenar los NaN
# "mean" devuelve la media de la serie
dataset.Age.fillna(value=dataset.Age.mean(), inplace=True)
dataset.Fare.fillna(value=dataset.Fare.median(), inplace=True)
# "value_counts" cuenta el número de veces que aparece cada valor en la columna
# "idxmax" devuelve el índice del valor máximo de la serie
# "inplace" indica que se quiere modificar el objeto original y no una copia
dataset.Embarked.fillna(value=(dataset.Embarked.value_counts().idxmax()), inplace=True) #asigna el valor más frecuente a los NaN
dataset.Survived.fillna(value=1, inplace=True) #asigna el valor 1 a los NaN

# unimos las dos columnas "SibSp y Parch" en solo una
# con el nobre de la nueva columna "Family_Size"

In [9]:
# "dataframe" sirve para crear un nuevo dataframe a partir de otro dataframe
# "apply" aplica una función a cada fila o columna del dataframe
# "lambda" es una función anónima que se define en una sola línea y realiza la operación deseada la cual es sumar las columnas "SibSp" y "Parch"
# "axis=1" indica que se quiere aplicar la función a las filas (0 para las columnas)
# "columns" indica el nombre de la nueva columna que se va a crear
fsiz = pd.DataFrame(dataset.apply(lambda x: x.SibSp + x.Parch, axis=1), columns=["Family_Size"])
# "join" une dos dataframes por el índice
data = dataset.join(fsiz) #guarda el nuevo dataframe en la variable "data"

In [10]:
data[["Age", "Fare", "Family_Size", "Survived"]]

           Age     Fare  Family_Size  Survived
0    22.000000   7.2500            1         0
1    38.000000  71.2833            1         1
2    26.000000   7.9250            0         1
3    35.000000  53.1000            1         1
4    35.000000   8.0500            0         0
..         ...      ...          ...       ...
886  27.000000  13.0000            0         0
887  19.000000  30.0000            0         1
888  29.699118  23.4500            3         0
889  26.000000  30.0000            0         1
890  32.000000   7.7500            0         0

[891 rows x 4 columns]

# Eliminamos columnas innecesaria para el entrenamiento

In [11]:
data.drop("Name", axis=1, inplace=True) #elimina la columna "Name" del dataframe
data.drop("Parch", axis=1, inplace=True) #elimina la columna "Embarked" del dataframe
data.drop("Ticket", axis=1, inplace=True) #elimina la columna "Ticket" del dataframe
data.drop("Cabin", axis=1, inplace=True) #elimina la columna "Cabin" del dataframe
data.drop("PassengerId", axis=1, inplace=True) #elimina la columna "PassengerId" del dataframe
data.drop("SibSp", axis=1, inplace=True) #elimina la columna "SibSp" del dataframe

In [12]:
data.head(3)

   Survived  Pclass     Sex   Age     Fare Embarked  Family_Size
0         0       3    male  22.0   7.2500        S            1
1         1       1  female  38.0  71.2833        C            1
2         1       3  female  26.0   7.9250        S            0

In [13]:
data.dtypes

Survived         int64
Pclass           int64
Sex             object
Age            float64
Fare           float64
Embarked        object
Family_Size      int64
dtype: object

In [14]:
# mostramos que las dos columnas son aun objecto
data[["Sex", "Embarked"]]

        Sex Embarked
0      male        S
1    female        C
2    female        S
3    female        S
4      male        S
..      ...      ...
886    male        S
887  female        S
888  female        S
889    male        C
890    male        Q

[891 rows x 2 columns]

# Exploramos las colamnas que no tienen un valor numerico

In [15]:
for col in data.select_dtypes(exclude=["number"]).columns:
    print("convertir columnas " + col + "...")
    data[col] = data[col].astype("category")
    print(data[col].cat.categories) #muestra las categorías de la columna
    data[col] = data[col].cat.codes #convierte las categorías a números

convertir columnas Sex...
Index(['female', 'male'], dtype='object')
convertir columnas Embarked...
Index(['C', 'Q', 'S'], dtype='object')

In [16]:
data.dtypes

Survived         int64
Pclass           int64
Sex               int8
Age            float64
Fare           float64
Embarked          int8
Family_Size      int64
dtype: object

# Dataset Completo

In [17]:
data.head(5)

   Survived  Pclass  Sex   Age     Fare  Embarked  Family_Size
0         0       3    1  22.0   7.2500         2            1
1         1       1    0  38.0  71.2833         0            1
2         1       3    0  26.0   7.9250         2            0
3         1       1    0  35.0  53.1000         2            1
4         0       3    1  35.0   8.0500         2            0

# Dividimos en los atributos y la etiqueta

In [18]:
# Y = f(X)
Y = data["Survived"] #variable dependiente
X = data.drop("Survived", axis=1) #variable independiente
print(X.shape, Y.shape) #muestra las dimensiones de las variables X e Y

(891, 6) (891,)

# # ************************ Machine Learning ************************

# Dividimos el Dataset en "entrenamiento y pruebas"

In [19]:
import sklearn
from sklearn.model_selection import train_test_split

TRAIN_SIZE = 0.8 #tamaño del conjunto de entrenamiento 80%
TESTING_SIZE = 0.2 #tamaño del conjunto de prueba 20%

# "train_test_split" divide el conjunto de datos en dos conjuntos: uno para entrenamiento y otro para prueba
# "test_size" indica el tamaño del conjunto de prueba lo que significa que el 20% de los datos se utilizarán para la prueba y el 80% para el entrenamiento
# "random_state" es una semilla para el generador de números aleatorios, lo que permite reproducir los resultados
X_train, X_test, Y_train, Y_test = train_test_split(X, Y, test_size=TESTING_SIZE, random_state=42) 
print(X_train.shape, Y_train.shape) #muestra las dimensiones del conjunto de entrenamiento
print(X_test.shape, Y_test.shape) #muestra las dimensiones del conjunto de prueba

(712, 6) (712,)
(179, 6) (179,)

# Arbol de decisiones - DecisionTreeClassifier

In [57]:
from sklearn.tree import DecisionTreeClassifier
# "random_state" es una semilla para el generador de números aleatorios, lo que permite reproducir los resultados
modelo_1 = DecisionTreeClassifier(random_state=0) #crea un modelo de árbol de decisión
modelo_1.fit(X_train, Y_train) #entrena el modelo con el conjunto de entrenamiento
# "score" devuelve la precisión del modelo en el conjunto de prueba
print(modelo_1.score(X_train, Y_train)) #muestra la precisión del modelo en el conjunto de entrenamiento

0.9803370786516854

# RandomForestClassifier

In [56]:
from sklearn.ensemble import RandomForestClassifier
modelo_2 = RandomForestClassifier(n_estimators=30) #crea un modelo de bosque aleatorio
modelo_2 = modelo_2.fit(X_train, Y_train) #entrena el modelo con el conjunto de entrenamiento
print(modelo_2.score(X_train, Y_train)) #muestra la precisión del modelo en el conjunto de entrenamiento

0.976123595505618

# Evaluacion

In [45]:
print("Decision Tree: ")
print(modelo_1.score(X_test, Y_test)) #muestra la precisión del modelo en el conjunto de prueba

Decision Tree:
0.7653631284916201

In [46]:
print("Decision Tree: ")
print(modelo_2.score(X_test, Y_test)) #muestra la precisión del modelo en el conjunto de prueba

Decision Tree:
0.8100558659217877

In [47]:
from sklearn.metrics import confusion_matrix
y_pre_mi1 = modelo_1.predict(X_test) #predice los valores del conjunto de prueba
y_pre_mi2 = modelo_2.predict(X_test) #predice los valores del conjunto de prueba

In [48]:
confusion_matrix(Y_test, y_pre_mi1) #matriz de confusión del modelo 1

array([[84, 21],
       [21, 53]], dtype=int64)

In [49]:
confusion_matrix(Y_test, y_pre_mi2) #matriz de confusión del modelo 2

array([[91, 14],
       [20, 54]], dtype=int64)